ws-asahi/UkiUkiCore/megaavr/boards.txt
# =====================================================================
#  UkiUkiCore - boards.txt
#  The UkiUkiduino product boards only (all other MCU/board families from
#  DxCore / WazamonoCore are removed):
#    - UkiUkiduino           (AVR64DU32, Arduino Uno R3 form factor, USB-C)
#    - UkiUkimicro  (AVR64DU32, Pro Micro form factor, USB-C)
#  Derived from DxCore's avrduusb (USB-CDC bootloader) definition via
#  WazamonoCore; DxCore (C) Spence Konde, LGPL 2.1.
#  Customizations (C) Workshop Asahi.
#
#  Both boards are CRYSTAL-LESS by design and aimed at beginners: the
#  system clock is the internal OSCHF (24 MHz default, 16 MHz selectable;
#  build.speed / build.clocksource below). USB CLK_USB (48 MHz) = OSCHF +
#  PLL48M, SOF-tuned, independent of the system clock. PA0/PA1 (the XTALHF
#  pads) are used as on-board LED / button pins.
# =====================================================================

# =====================  UkiUkiduino (AVR64DU32)  =====================
#  Arduino Uno R3 form factor. AVR64DU32 + USB-CDC bootloader. Timer use:
#  millis() is on TCB0 so TCB1 is free for D3 PWM (TCB1 ALT1 = PF5) and
#  for tone() (Tone.cpp routes tone to TCB1 whenever millis is on TCB0;
#  tone therefore shares TCB1 with D3 PWM - using tone() suspends D3 PWM
#  only, exactly like Uno R3's Timer2, but D11 PWM (TCA0) is preserved).
menu.clock=Clock Speed
menu.usbeps=USB Endpoints

ukiukiduino.name=UkiUkiduino

ukiukiduino.upload.tool=avrdude
ukiukiduino.upload.prog_interlock=
# --- USB identity: pid.codes TEST-range placeholders (app 0x000C / boot 0x000B).
#     Replace with the official pid.codes VID/PID before release. Keep in sync
#     with variants/UkiUkiduino/pins_arduino.h and the bootloader build. ---
ukiukiduino.vid.0=0x1209
ukiukiduino.pid.0=0x000C
ukiukiduino.vid.1=0x1209
ukiukiduino.pid.1=0x000B
ukiukiduino.build.board=AVR_UKIUKIDUINO
ukiukiduino.build.core=dxcore
ukiukiduino.build.f_cpu={build.speed}000000L
ukiukiduino.build.text_section_start=.text=0x1000
ukiukiduino.build.defaultswaps=
ukiukiduino.build.extra_flags= {build.defaultswaps} -DUSING_AVRDU_CDC_BOOTLOADER -DUSING_USBBOOT -DUSB_VREG_INTERNAL {build.usbepflags}
ukiukiduino.menu.usbeps.ep8=8 (EP0-EP7, standard)
ukiukiduino.menu.usbeps.ep8.build.usbepflags=
ukiukiduino.menu.usbeps.ep16=16 (EP0-EP15, extended)
ukiukiduino.menu.usbeps.ep16.build.usbepflags=-DUSB_EP_SLOTS=16
# Force-link the variant init TU (variants/UkiUkiduino/ukiukiduino_init.cpp).
# Arduino archives variant objects into core.a, so its strong initVariant() that
# sets up the CCL/EVSYS LED mirror would otherwise be dropped (core main.cpp has
# a weak initVariant). -u pulls the member; the marker symbol is in that file.
ukiukiduino.compiler.c.elf.extra_flags=-Wl,-u,ukiukiduino_variant_keep -Wl,--defsym,__flmap_lock=1
ukiukiduino.build.rodata_flags=
ukiukiduino.build.export_merged_output=false
ukiukiduino.build.printf=
ukiukiduino.build.flmapopts=
ukiukiduino.build.attachmode=-DCORE_ATTACH_ALL
ukiukiduino.bootloader.tool=avrdude
ukiukiduino.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
ukiukiduino.bootloader.wdtwindowbits=0000
ukiukiduino.bootloader.BODCFG=0x00
ukiukiduino.bootloader.updipinbit=1
ukiukiduino.bootloader.SYSCFG0=0b110{bootloader.updipinbit}{bootloader.resetpinbits}00{bootloader.eesavebit}
ukiukiduino.bootloader.SYSCFG1=0b00001{bootloader.sutbits}
ukiukiduino.bootloader.CODESIZE=0x00
ukiukiduino.bootloader.BOOTSIZE=0x08
ukiukiduino.bootloader.OSCCFG=0b00000000

# ---- Locked option defaults (menus removed; values fixed for the product) ----
# Bootloader fuse bits (burn-bootloader): WDT off, BOD off, EEPROM retained,
#   reset pin = Hardware Reset, startup 8ms. (BODCFG fixed above = 0x00.)
ukiukiduino.bootloader.wdttimeoutbits=0000
ukiukiduino.bootloader.eesavebit=1
ukiukiduino.bootloader.resetpinbit=1
ukiukiduino.bootloader.sutbits=100
# Compile-time options: millis=TCB0 (frees TCB1 for D3 PWM + tone), Wire=single.
ukiukiduino.build.millistimer=B0
ukiukiduino.build.wiremode=MORS_SINGLE
ukiukiduino.bootloader.resetpinbits={bootloader.resetpinbit}
ukiukiduino.bootloader.avrdudefuse5="-Ufuse5:w:{bootloader.SYSCFG0}:m"
ukiukiduino.program.avrdudefuse5="-Ufuse5:w:{bootloader.SYSCFG0}:m"
ukiukiduino.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
ukiukiduino.bootloader.pymcuprogstring=-aerase
ukiukiduino.build.mcupostfix=
ukiukiduino.build.printfabr=
ukiukiduino.build.flmapabr=.ful
ukiukiduino.build.attachabr=
ukiukiduino.build.wireabr=.wO
ukiukiduino.build.appspmabr=
ukiukiduino.upload.protocol=arduino
ukiukiduino.upload.speed=115200
ukiukiduino.upload.extra_params=-D
ukiukiduino.upload.use_1200bps_touch=true
ukiukiduino.upload.wait_for_upload_port=true
ukiukiduino.bootloader.file=hex/{bootloader.class}.hex
ukiukiduino.bootloader.appspm=

# --- Clock: internal OSCHF (crystal-less), 24 MHz default; 12/16/20 MHz selectable. ---
#  clocksource 0 = internal OSCHF. USB CLK_USB (48 MHz) = OSCHF's fixed 4 MHz tap + PLL48M,
#  SOF-tuned, so it is independent of the main clock (CLK_PER only needs to be >= 12 MHz,
#  DS40002548B 28.3.1.1). The on-board WS2812 drivers are cycle-counted for all four speeds.
ukiukiduino.menu.clock.24internal=24 MHz internal
ukiukiduino.menu.clock.24internal.build.speed=24
ukiukiduino.menu.clock.24internal.build.clocksource=0
ukiukiduino.menu.clock.20internal=20 MHz internal
ukiukiduino.menu.clock.20internal.build.speed=20
ukiukiduino.menu.clock.20internal.build.clocksource=0
ukiukiduino.menu.clock.16internal=16 MHz internal
ukiukiduino.menu.clock.16internal.build.speed=16
ukiukiduino.menu.clock.16internal.build.clocksource=0
ukiukiduino.menu.clock.12internal=12 MHz internal
ukiukiduino.menu.clock.12internal.build.speed=12
ukiukiduino.menu.clock.12internal.build.clocksource=0

# --- Locked to AVR64DU32. Variant + bootloader hex fixed to UkiUkiduino. ---
ukiukiduino.build.mcu=avr64du32
ukiukiduino.build.variant=UkiUkiduino
ukiukiduino.build.highestcb=B2
ukiukiduino.upload.maximum_size=61440
ukiukiduino.upload.maximum_data_size=8192
ukiukiduino.bootloader.class=usbcdcboot_ukiukiduino

# =================  UkiUkimicro (AVR64DU32)  =================
#  Pro Micro form factor (derived from the Wazamono Tachi rev.5 layout).
#  AVR64DU32 + USB-CDC bootloader, 5 V only (no regulator: RAW = VCC = +5V).
#  On-board: WS2812B full-color LED (LED_BUILTIN = D17, mirrored from PF5 to
#  PF4), user button BTN_BUILTIN = D22 (PF0, pull-down, pressed = HIGH),
#  TX/RX activity LEDs on PA0/PA1 (active-LOW). Timer use: millis() on TCB0,
#  TCB1 drives the exclusive D3/D4/D7 PWM outlet and tone(); TCA0 -> PORTD
#  gives the classic Pro Micro PWM set D5/D6/D9/D10 (+ D14/D16).
ukiukimicro.name=UkiUkimicro

ukiukimicro.upload.tool=avrdude
ukiukimicro.upload.prog_interlock=
# --- USB identity: pid.codes TEST-range placeholders (app 0x000E / boot 0x000D;
#     distinct from the Uno-form UkiUkiduino so both can be plugged in at once).
#     Replace with the official pid.codes VID/PID before release. Keep in sync
#     with cores/dxcore/usb_descriptors.{h,c}, variants/UkiUkimicro/
#     pins_arduino.h and the bootloader build (build_ukiukiduino.sh/.bat). ---
ukiukimicro.vid.0=0x1209
ukiukimicro.pid.0=0x000E
ukiukimicro.vid.1=0x1209
ukiukimicro.pid.1=0x000D
ukiukimicro.build.board=AVR_UKIUKIMICRO
ukiukimicro.build.core=dxcore
ukiukimicro.build.f_cpu={build.speed}000000L
ukiukimicro.build.text_section_start=.text=0x1000
ukiukimicro.build.defaultswaps=
ukiukimicro.build.extra_flags= {build.defaultswaps} -DUSING_AVRDU_CDC_BOOTLOADER -DUSING_USBBOOT -DUSB_VREG_INTERNAL {build.usbepflags}
ukiukimicro.menu.usbeps.ep8=8 (EP0-EP7, standard)
ukiukimicro.menu.usbeps.ep8.build.usbepflags=
ukiukimicro.menu.usbeps.ep16=16 (EP0-EP15, extended)
ukiukimicro.menu.usbeps.ep16.build.usbepflags=-DUSB_EP_SLOTS=16
# Force-link the variant init TU (variants/UkiUkimicro/
# ukiukimicro_init.cpp): strong initVariant() (LED blanking) plus the
# USB-CDC TX/RX activity-LED hooks would otherwise be dropped from core.a.
ukiukimicro.compiler.c.elf.extra_flags=-Wl,-u,ukiukimicro_variant_keep -Wl,--defsym,__flmap_lock=1
ukiukimicro.build.rodata_flags=
ukiukimicro.build.export_merged_output=false
ukiukimicro.build.printf=
ukiukimicro.build.flmapopts=
ukiukimicro.build.attachmode=-DCORE_ATTACH_ALL
ukiukimicro.bootloader.tool=avrdude
ukiukimicro.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
ukiukimicro.bootloader.wdtwindowbits=0000
ukiukimicro.bootloader.BODCFG=0x00
ukiukimicro.bootloader.updipinbit=1
ukiukimicro.bootloader.SYSCFG0=0b110{bootloader.updipinbit}{bootloader.resetpinbits}00{bootloader.eesavebit}
ukiukimicro.bootloader.SYSCFG1=0b00001{bootloader.sutbits}
ukiukimicro.bootloader.CODESIZE=0x00
ukiukimicro.bootloader.BOOTSIZE=0x08
ukiukimicro.bootloader.OSCCFG=0b00000000

# ---- Locked option defaults (menus removed; values fixed for the product) ----
# Bootloader fuse bits (burn-bootloader): WDT off, BOD off, EEPROM retained,
#   reset pin = Hardware Reset, startup 8ms. (BODCFG fixed above = 0x00.)
ukiukimicro.bootloader.wdttimeoutbits=0000
ukiukimicro.bootloader.eesavebit=1
ukiukimicro.bootloader.resetpinbit=1
ukiukimicro.bootloader.sutbits=100
# Compile-time options: millis=TCB0 (frees TCB1 for D3/D4/D7 PWM + tone), Wire=single.
ukiukimicro.build.millistimer=B0
ukiukimicro.build.wiremode=MORS_SINGLE
ukiukimicro.bootloader.resetpinbits={bootloader.resetpinbit}
ukiukimicro.bootloader.avrdudefuse5="-Ufuse5:w:{bootloader.SYSCFG0}:m"
ukiukimicro.program.avrdudefuse5="-Ufuse5:w:{bootloader.SYSCFG0}:m"
ukiukimicro.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
ukiukimicro.bootloader.pymcuprogstring=-aerase
ukiukimicro.build.mcupostfix=
ukiukimicro.build.printfabr=
ukiukimicro.build.flmapabr=.ful
ukiukimicro.build.attachabr=
ukiukimicro.build.wireabr=.wO
ukiukimicro.build.appspmabr=
ukiukimicro.upload.protocol=arduino
ukiukimicro.upload.speed=115200
ukiukimicro.upload.extra_params=-D
ukiukimicro.upload.use_1200bps_touch=true
ukiukimicro.upload.wait_for_upload_port=true
ukiukimicro.bootloader.file=hex/{bootloader.class}.hex
ukiukimicro.bootloader.appspm=

# --- Clock: internal OSCHF (crystal-less), 24 MHz default; 12/16/20 MHz selectable. ---
#  clocksource 0 = internal OSCHF. USB CLK_USB (48 MHz) = OSCHF's fixed 4 MHz tap + PLL48M,
#  SOF-tuned, so it is independent of the main clock (CLK_PER only needs to be >= 12 MHz,
#  DS40002548B 28.3.1.1). The on-board WS2812 drivers are cycle-counted for all four speeds.
ukiukimicro.menu.clock.24internal=24 MHz internal
ukiukimicro.menu.clock.24internal.build.speed=24
ukiukimicro.menu.clock.24internal.build.clocksource=0
ukiukimicro.menu.clock.20internal=20 MHz internal
ukiukimicro.menu.clock.20internal.build.speed=20
ukiukimicro.menu.clock.20internal.build.clocksource=0
ukiukimicro.menu.clock.16internal=16 MHz internal
ukiukimicro.menu.clock.16internal.build.speed=16
ukiukimicro.menu.clock.16internal.build.clocksource=0
ukiukimicro.menu.clock.12internal=12 MHz internal
ukiukimicro.menu.clock.12internal.build.speed=12
ukiukimicro.menu.clock.12internal.build.clocksource=0

# --- Locked to AVR64DU32. Variant + bootloader hex fixed to UkiUkimicro. ---
ukiukimicro.build.mcu=avr64du32
ukiukimicro.build.variant=UkiUkimicro
ukiukimicro.build.highestcb=B2
ukiukimicro.upload.maximum_size=61440
ukiukimicro.upload.maximum_data_size=8192
ukiukimicro.bootloader.class=usbcdcboot_ukiukimicro
